In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plot

In [5]:
vacation = pd.read_csv("Section2/vacation.csv", skiprows=2, index_col='Month', parse_dates=['Month'])
vacation.head()

            vacation: (United States)
Month
2004-01-01                         94
2004-02-01                         89
2004-03-01                         86
2004-04-01                         79
2004-05-01                         89

In [6]:
vacation.isna().sum()

vacation: (United States)    0
dtype: int64

In [9]:
vacation.columns=['Num_Search_Vacation']

In [11]:
vacation.head()

            Num_Search_Vacation
Month
2004-01-01                   94
2004-02-01                   89
2004-03-01                   86
2004-04-01                   79
2004-05-01                   89

In [12]:
vacation.describe().T

,count,mean,std,min,25%,50%,75%,max
Num_Search_Vacation,190.0,60.215789,15.513461,35.0,50.0,56.0,70.0,100.0